app/Http/Controllers/ChildDealer/DashboardController.php

    public function index()
    {

        $childDealer = Dealer::where('user_id', Auth::id())->first();
        $deviceInsurance = DeviceInsurance::where('child_dealer_id', $childDealer->id)->where('status', 'completed');
        $totalInsSale = $deviceInsurance->count();
        $totalEarn = $deviceInsurance->sum('child_dealer_commission');
---
select * from `dealers` where `user_id` = 168 limit 1
select count(*) as aggregate from `device_insurances` where `child_dealer_id` = 56 and `status` = 'completed'
select sum(`child_dealer_commission`) as aggregate from `device_insurances` where `child_dealer_id` = 56 and `status` = 'completed'