app/Http/Controllers/ChildDealer/DeviceInsuranceController.php

select * from `dealers` where `user_id` = 168 limit 1
select * from `device_insurances` where `child_dealer_id` = 56 order by `created_at` desc
---
    public function index()
    {
        $childDealer = Dealer::where('user_id', Auth::id())->first();

        $deviceInsurances = DeviceInsurance::where('child_dealer_id', $childDealer->id)->latest()->get();

select * from `users` where `users`.`id` = '152' limit 1
select * from `device_subcategories` where (`status` = 1) and `name` like '%Mobile%' and `name` like '%phone%' limit 1
select * from `dealers` where `user_id` = 168 limit 1
select `brands`.*, `parent_brands`.`dealer_id` as `pivot_dealer_id`, `parent_brands`.`brand_id` as `pivot_brand_id`, `parent_brands`.`created_at` as `pivot_created_at`, `parent_brands`.`updated_at` as `pivot_updated_at` from `brands` inner join `parent_brands` on `brands`.`id` = `parent_brands`.`brand_id` where `parent_brands`.`dealer_id` in (46)
---
    public function create($id)
    {
        $user = User::find(($id));
        if (!$user) {
            Toastr::error('Invalid request');
            return redirect()->route('childDealer.select-customer');
        }
        $deviceSubcategories = DeviceSubcategory::where(['status' => 1])->where('name', 'like', '%Mobile%')->where('name', 'like', '%phone%')->first()->id;

        ## Find child dealer brands inherited from parent dealer ##
        $brands = [];
        $child_dealer = Dealer::with(['parent.brands'])->where('user_id', Auth::id())->first();

select * from `dealers` where `user_id` = 168 limit 1
select * from `dealers` where `dealers`.`id` = 46 limit 1
select * from `insurance_packages` where `insurance_packages`.`id` = '11' limit 1
select * from `parent_child_dealer_packages` where `package_id` = '11' and `child_id` = 56 order by `created_at` desc limit 1
select * from `parent_child_dealer_packages` where `package_id` = '11' and `parent_id` = 46 order by `created_at` desc limit 1
---
        // dd($request->all());


        $childDealer = Dealer::where('user_id', Auth::id())->first();
        $parentDealer = Dealer::find($childDealer->parent_id);

        $package = InsurancePackage::find($request->package_id);
        $isChildInPackage = ParentChildDealerPackage::where('package_id', $request->package_id)
            ->where('child_id', $childDealer->id)->latest()->first();
        $isParentInPackage = ParentChildDealerPackage::where('package_id', $request->package_id)
            ->where('parent_id', $parentDealer->id)->latest()->first();

select * from `brands` where `brands`.`id` = '8' limit 1
select * from `device_models` where `device_models`.`id` = '31' limit 1
---
        $customerInfo['number']                     = $request->number;
        $DeviceInsurance->customer_info             = json_encode($customerInfo);
        ## Find Brand & Device Model
        $brand                                      = Brand::find($request->brand_id);
        $model                                      = DeviceModel::find($request->device_model_id);

select * from `insurance_prices` where `insurance_prices`.`id` = '30' limit 1
select * from `insurance_types` where `insurance_types`.`id` = 22 limit 1
---
        }
        if (!empty($request->insurance_price_id)) {
            foreach ($request->insurance_price_id as $pId) {
                $insPrice = InsurancePrice::find($pId);
                $insDevice =  InsuranceType::find($insPrice->insurance_type_id);

select * from `insurance_discounts` where `device_subcategory_id` = 1 and `device_brand_id` = '8' and `device_model_id` = '31' and `status` = 1 and `date_from` <= '2022-12-19' and `date_to` >= '2022-12-19' and `time_from` <= '17:18:46' and `time_to` >= '17:18:46' and `parent_id` = 46 and `inc_exc_type` = 'excluded' order by `created_at` desc limit 1
select * from `insurance_discounts` where `device_subcategory_id` = 1 and `device_brand_id` = 0 and `device_model_id` = 0 and `date_from` <= '2022-12-19' and `date_to` >= '2022-12-19' and `time_from` <= '17:18:46' and `time_to` >= '17:18:46' and `inc_exc_type` = 'excluded' and `status` = 1 order by `created_at` desc limit 1
---
        }
        $date    =    date('Y-m-d');
        $time   =    date('H:i:s');
        $discount = InsuranceDiscount::where('device_subcategory_id', 1)
            ->where('device_brand_id', $request->brand_id)->where('device_model_id',  $request->device_model_id)
            ->where('status', 1)
            ->where('date_from', "<=", $date)
            ->where('date_to', ">=", $date)
            ->where('time_from', "<=", $time)
            ->where('time_to', ">=", $time)
            ->where('parent_id', $childDealer->parent_id)
            ->where('inc_exc_type', $package->inc_exc_type)
            ->latest()->first();

        if (empty($discount)) {
            $discount = InsuranceDiscount::where('device_subcategory_id', 1)
                ->where('device_brand_id', 0)->where('device_model_id', 0)
                ->where('date_from', "<=", $date)
                ->where('date_to', ">=", $date)
                ->where('time_from', "<=", $time)
                ->where('time_to', ">=", $time)
                ->where('inc_exc_type', $package->inc_exc_type)
                ->where('status', 1)
                ->latest()->first();

insert into `device_insurances` (`customer_info`, `device_info`, `user_id`, `imei_one`, `imei_two`, `customer_will_pay_charge`, `parent_dealer_id`, `child_dealer_id`, `package_type`, `package_id`, `invoice_code`, `sub_total`, `total_vat`, `grand_total`, `insurance_type_value`, `totalAmountForCal`, `includedAmount`, `includedVatAmount`, `vat_pecentage`, `total_discount`, `parent_will_pay_to_admin`, `parent_will_pay_to_child`, `parent_dealer_commission`, `child_dealer_commission`, `other_dealer_commission`, `instasure_amount`, `claimable_amount`, `claimed_amount`, `updated_at`, `created_at`) values ('{\"name\":\"Ali\",\"customer_name\":\"Ali\",\"customer_phone\":\"01712655156\",\"customer_email\":\"mohammad.ali@dnsgroup.net\",\"inc_exc_type\":\"nid\",\"number\":\"1234\"}', '{\"device_model_id\":\"31\",\"brand_id\":\"8\",\"brand_name\":\"OnePlus\",\"model_name\":\"OnePlus Nord 2 5G\",\"device_price\":\"10000\",\"device_name\":\"OnePlus Nord 2 5G OnePlus\",\"imei_one\":\"111111111111111\",\"imei_two\":null,\"battery_number\":\"1\"}', '152', '111111111111111', '', 1, 46, 56, 'excluded', '11', 434009, 600, '600.00', 1200, '[{\"parts_type\":\"Damage\",\"price\":600,\"ins_type\":\"excluded\"}]', 600, 0, '0.00', 100, 0, 0, 0, 60, 120, 0, 1200, '10000', 0, '2022-12-19 17:18:46', '2022-12-19 17:18:46')
---

        try {
            ## Save new or update IMEI data
            $DeviceInsurance->save();

select * from `imei_datas` where (`imei_1` = '111111111111111' and `status` = 1 and `is_used` = 1) limit 1
select * from `imei_datas` where (`imei_1` = '111111111111111111111' and `status` = 1 and `is_used` = 0) limit 1
---

            ## Insert or update imei data

            $imeiUsed = ImeiData::where(['imei_1' => $request->imei_one, 'status' => 1, 'is_used' => 1])->first();
            if ($imeiUsed) {
                throw new \Exception('IMEI already used');
            }
            $imeiExist = ImeiData::where(['imei_1' => $request->imei_one, 'status' => 1, 'is_used' => 0])->first();

delete from `device_insurances` where `id` = 104
---

            return redirect()->route('childDealer.device-insurance.order', encrypt($DeviceInsurance->id));
        } catch (\Throwable $th) {
            $DeviceInsurance->delete();

select * from `categories` where `categories`.`id` in (6)
select * from `device_insurances` where `device_insurances`.`id` = 105 limit 1
select * from `policy_providers` where `policy_providers`.`id` in (2)
---
    public function getDeviceOrderDetails($id)
    {
        $deviceOrderDetails = DeviceInsurance::with(['package.policy_provider', 'package.insurance_category'])->find((decrypt($id)));

select * from `device_models` where `brand_id` = '8'
---
    public function getDeviceModels(Request $request)
    {

        $deviceModels = DeviceModel::where('brand_id', $request->brand_id)->get();

select * from `dealers` where `user_id` = 168 limit 1
select `insurance_packages`.* from `insurance_packages` inner join `parent_child_dealer_packages` on `parent_child_dealer_packages`.`package_id` = `insurance_packages`.`id` where `device_subcategory_id` = '3' and `insurance_packages`.`brand_id` = '8' and `insurance_packages`.`device_model_id` = '31' and `insurance_packages`.`date_from` <= '2022-12-19' and `insurance_packages`.`date_to` >= '2022-12-19' and `parent_child_dealer_packages`.`child_id` = 56 and `insurance_packages`.`status` = 1 order by `created_at` desc limit 1
select `insurance_packages`.* from `insurance_packages` where `device_subcategory_id` = '3' and `insurance_packages`.`brand_id` = '8' and `insurance_packages`.`device_model_id` = '31' and `insurance_packages`.`date_from` <= '2022-12-19' and `insurance_packages`.`date_to` >= '2022-12-19' and `insurance_packages`.`parent_id` = 0 and `insurance_packages`.`status` = 1 order by `created_at` desc limit 1
select * from `insurance_packages` where `device_subcategory_id` = '3' and `brand_id` = 0 and `device_model_id` = 0 and `status` = 1 order by `created_at` desc limit 1
---
    public function getPackage(Request $request)
    {

        $childDealer        = Dealer::where('user_id', Auth::id())->first();
        $date               = date('Y-m-d');
        $time               = date('H:i:s');
        $device_price       = $request->device_price;
        $insurancePackage   = null;

        $insurancePackage   = InsurancePackage::where('device_subcategory_id', $request->device_subcategory_id)
            ->select('insurance_packages.*')
            ->join('parent_child_dealer_packages', 'parent_child_dealer_packages.package_id', '=', 'insurance_packages.id')
            ->where('insurance_packages.brand_id', $request->brand_id)
            ->where('insurance_packages.device_model_id',  $request->device_model_id)
            ->where('insurance_packages.date_from', "<=", $date)
            ->where('insurance_packages.date_to', ">=", $date)
            ->where('parent_child_dealer_packages.child_id', $childDealer->id)
            ->where('insurance_packages.status', 1)
            ->latest()->first();

        if (empty($insurancePackage)) {
            $insurancePackage   = InsurancePackage::where('device_subcategory_id', $request->device_subcategory_id)
                ->select('insurance_packages.*')
                ->where('insurance_packages.brand_id', $request->brand_id)
                ->where('insurance_packages.device_model_id',  $request->device_model_id)
                ->where('insurance_packages.date_from', "<=", $date)
                ->where('insurance_packages.date_to', ">=", $date)
                ->where('insurance_packages.parent_id', 0)
                ->where('insurance_packages.status', 1)
                ->latest()->first();
            if (empty($insurancePackage)) {
                $insurancePackage = InsurancePackage::where('device_subcategory_id', $request->device_subcategory_id)
                    ->where('brand_id', 0)
                    ->where('device_model_id', 0)
                    ->where('status', 1)
                    ->latest()->first();

select * from `insurance_prices` where `insurance_package_id` = 11
---
        }


        $insurancePrices = InsurancePrice::where('insurance_package_id', $insurancePackage->id)->get();

select * from `users` where (`phone` = '01712655156' and `user_type` = 'customer') limit 1
---
    public function get_customer(Request $request)
    {
        $user = User::where(['phone' => $request->phone, 'user_type' => 'customer'])->first();