app/Helpers/helper.php

select * from `business_settings` where `type` = 'other_dealer_commission' limit 1
---
    function getBusinessSettingValue($type)
    {
        return BusinessSetting::where('type', $type)->first()->value;

select * from `categories` where `name` = 'Device Insurance' limit 1
---
function vat_recognizer($cat = '')
{
    try {
        if($cat != ''){
            return Category::where('name', $cat)->first()->getOriginal('vat');

select * from `categories` where `name` = 'Travel Medical Insurance' limit 1
---
function serviceCharge_recognizer($cat = '')
{
    try {
        if($cat != ''){
            return Category::where('name', $cat)->first()->getOriginal('service');

select * from `insurance_prices` where `insurance_prices`.`id` = 30 limit 1
---
    function InsurancePriceCalculation($id, $handSetAmount)
    {
        $insPrice = \App\Model\InsurancePrice::find($id);

select * from `device_insurances` where `device_insurances`.`id` = 103 limit 1
select * from `dealers` where `dealers`.`id` = 46 limit 1
update `dealers` set `dealer_balance` = 1197.85, `dealers`.`updated_at` = '2022-12-19 17:15:14' where `id` = 46
select * from `dealers` where `dealers`.`id` = 56 limit 1
update `device_insurances` set `policy_number` = 'I60191465479', `device_insurances`.`updated_at` = '2022-12-19 17:15:14' where `id` = 103
update `dealers` set `dealer_balance` = 2394.7, `dealers`.`updated_at` = '2022-12-19 17:15:14' where `id` = 56
update `device_insurances` set `status` = 'completed', `policy_number` = 'I60178256719', `device_insurances`.`updated_at` = '2022-12-19 17:21:09' where `id` = 105
---
    function deviceInsuranceCommissionsDisbursed($orderId): int
    {
        $deviceInsurance = DeviceInsurance::with(['package'])->find($orderId);


        $policy_provider_code = (string) $deviceInsurance->package->policy_provider->code;
        // modified by Tovfikur
        try {
            $insurance_category_code = (string)  $deviceInsurance->package->insurance_category->code;
        } catch (\Throwable $th) {
            $insurance_category_code = (string)  $deviceInsurance->package->insurance_category_id;
        }

        if (!empty($deviceInsurance)) {
            $parentDealer = Dealer::find($deviceInsurance->parent_dealer_id);
            $parentDealer->dealer_balance += $deviceInsurance->parent_dealer_commission;
            $parentDealer->due_balance += $deviceInsurance->parent_will_pay_to_admin;
            $parentDealer->save();
            $childDealer = Dealer::find($deviceInsurance->child_dealer_id);
            $childDealer->dealer_balance += $deviceInsurance->child_dealer_commission;
            $childDealer->save();
            $deviceInsurance->status = 'completed';
            $deviceInsurance->policy_number = generateCustomPolicyNumber(8, $insurance_category_code, $policy_provider_code, 'I');
            $deviceInsurance->save();