app/Http/Controllers/Frontend/HomeController.php

    public function index()
    {
        $data['sliders'] = Slider::all();
---
select * from `sliders`

    public function dashboard()
    {
        $totalMediclaimOrder = TravelInsOrder::where('user_id', Auth::id())->count();
        $totalDeviceOrder = DeviceInsurance::where('user_id', Auth::id())->count();
        $totalDeviceClaim = DeviceClaim::where('user_id', Auth::id())->count();
        $totalDeviceClaimReq = DeviceClaimRequest::where('user_id', Auth::id())->count();
---
select count(*) as aggregate from `travel_ins_orders` where `user_id` = 152
select count(*) as aggregate from `device_insurances` where `user_id` = 152
select count(*) as aggregate from `device_claims` where `user_id` = 152
select count(*) as aggregate from `device_claim_requests` where `user_id` = 152

    public function insurancePurchaseDetails($id)
    {
        $travelOrder = TravelInsOrder::with('policy_provider')->find(decrypt($id));
---
select * from `policy_providers` where `policy_providers`.`id` in (4)
select * from `travel_ins_orders` where `travel_ins_orders`.`id` = 230 limit 1

    public function getPlanCategory(Request $request)
    {

        $planCategory = TravelInsPlansCategory::where('country_type', $request->country_type)->get();
---
select * from `travel_ins_plans_categories` where `country_type` = 'Non Schengen'

        // dd($request->all(), [$age, $total_date]);

        if ($age > 0) {
            $travelCategory = TravelInsPlansCategory::find($request->plan_category_id);
            $travelPlanCharts = TravelInsPlansChart::where('travel_ins_plans_category_id', $travelCategory->id)
                ->where('age_from', '<=', $age)
                ->where('age_to', '>=', $age)
                ->where('period_from', '<=', $total_date)
                ->where('period_to', '>=', $total_date)
                ->get();
---
select * from `travel_ins_plans_categories` where `travel_ins_plans_categories`.`id` = '5' limit 1
select * from `travel_ins_plans_charts` where `travel_ins_plans_category_id` = 5 and `age_from` <= 23.98 and `age_to` >= 23.98 and `period_from` <= 0 and `period_to` >= 0

    public function insuranceQuatationCalculation(Request $request)
    {

        $travelCategory = TravelInsPlansCategory::find($request->plan_category_id);
        $travelPlanChart = TravelInsPlansChart::find($request->package_id);
        $policyProvider = PolicyProvider::find($travelPlanChart->policy_provider_id);
---
select * from `travel_ins_plans_categories` where `travel_ins_plans_categories`.`id` = '5' limit 1
select * from `travel_ins_plans_charts` where `travel_ins_plans_charts`.`id` = '3' limit 1
select * from `policy_providers` where `policy_providers`.`id` = 4 limit 1

        $travelInsOrder->total_date = $request->total_date;
        $travelInsOrder->shipping_address = $request->shipping_address;
        $travelInsOrder->invoice_code = date('Ymd-his');
        $travelInsOrder->save();
---
insert into `travel_ins_orders` (`user_id`, `travel_insurance_category_title`, `travel_ins_plans_category_id`, `full_name`, `phone`, `email`, `dob`, `age`, `passport_number`, `passport_expire_till`, `ins_price`, `travel_ins_plans_charts_id`, `insurance_provider_id`, `vat_percentage`, `total_vat`, `service_amount`, `service_total_amount`, `grand_total`, `flight_number`, `flight_date`, `return_date`, `total_date`, `shipping_address`, `invoice_code`, `updated_at`, `created_at`) values (152, 'Non Schengen Plan A (Worldwide Excluding USA & Canada)', '5', 'Ali', '01712655156', 'mohammad.ali@dnsgroup.net', '1999-01-01', '23.98', '1245', '2023-01-18', 1115, 3, 4, 100, '1115.00', 100, '1115.00', 3345, '1245', '2022-12-20', '2022-12-21', '1', '11212', '20221220-011641', '2022-12-20 13:16:41', '2022-12-20 13:16:41')