app/Http/Controllers/Frontend/PaymentController.php

select * from `travel_ins_orders` where `travel_ins_orders`.`id` = '230' limit 1
select * from `device_insurances` where `device_insurances`.`id` = '103' limit 1
---
    public function PaywithCashFormUpdate(Request $request, $slug)
    {
        // CashAndCheckPayment($request->travel_ins_orders, $request->order_id);

        ## Travel insurance response after order process
        $request->id = $slug;
        try {
            if ($request->paytype == "travel") {
                $order                      = TravelInsOrder::find($request->id);
                $order->payment_method      = $request->method;
                $order->payment_status      = 'unpaid';
                $order->bank_name           = $request->bank_name;
                $order->issue_date          = $request->date;
                $order->check_number        = $request->number;
                $order->payment_details     = json_encode($request->all());
                $order->save();
                Toastr::success('Payment successfully Received');
                return redirect()->route('user.insurance.purchase.details', encrypt($order->id));
            } elseif($request->paytype == "device") {

                //COPY AND PASTE FROM aamrPaySuccess CONTROLLER

           ## Device insurance response after order process

           $order = DeviceInsurance::find($request->id);

select * from `imei_datas` where `imei_1` = '111111111111111' and `is_used` < 1 limit 1
---

               try {
                   ## Find IMEI Data and set is used true
                   $imeiUsed               = ImeiData::where('imei_1', $order->imei_one)->where('is_used', '<', 1)->first();

select * from `device_insurances` where `device_insurances`.`id` = 103 limit 1
---


               ## Find & updated order and customer informations
               $order                  = DeviceInsurance::find($order->id);