app/Http/Controllers/ParentDealer/ChildDealerController.php

select * from `dealers` where `user_id` = 150 limit 1
select * from `dealers` where `parent_id` = 46 order by `created_at` desc
---
    public function index()
    {
        $parent = Dealer::where('user_id', Auth::id())->first();
        $childDealers = Dealer::where('parent_id', $parent->id)->latest()->get();