app/Http/Controllers/ParentDealer/DashboardController.php

select * from `dealers` where `user_id` = 150 limit 1
select count(*) as aggregate from `device_insurances` where `parent_dealer_id` = 46 and `status` = 'completed'
select sum(`child_dealer_commission`) as aggregate from `device_insurances` where `parent_dealer_id` = 46 and `status` = 'completed'
select count(*) as aggregate from `dealers` where `parent_id` = 46
select sum(`amount`) as aggregate from `insurance_withdraw_requests` where `status` = 'paid' and `parent_id` = 150 and `user_id` = '=='
select sum(`amount`) as aggregate from `insurance_withdraw_requests` where `status` = 'received' and `parent_id` = 150 and `user_id` = '=='
select sum(`amount`) as aggregate from `insurance_withdraw_requests` where `status` = 'pending' and `parent_id` = 150 and `user_id` = '=='
---
    public function index()
    {
        $parentDealer               = Dealer::where('user_id', Auth::id())->first();
        $deviceInsSale              = DeviceInsurance::where('parent_dealer_id', $parentDealer->id)->where('status', 'completed');
        $data['totalInsSale']       = $deviceInsSale->count();
        $data['totalEarn']          = $deviceInsSale->sum('child_dealer_commission');
        $data['dealerBalance']      = $parentDealer->dealer_balance;
        $data['dueBalance']         = $parentDealer->due_balance;
        $data['childDealers']       = Dealer::where('parent_id', $parentDealer->id)->count();
        $data['paid_by_admin']      = InsuranceWithdrawRequest::where('status', '=', 'paid')->where('parent_id', Auth::id())->where('user_id', '==', 0)->sum('amount');
        $data['received_amount']    = InsuranceWithdrawRequest::where('status', '=', 'received')->where('parent_id', Auth::id())->where('user_id', '==', 0)->sum('amount');
        $data['pending_amount']     = InsuranceWithdrawRequest::where('status', '=', 'pending')->where('parent_id', Auth::id())->where('user_id', '==', 0)->sum('amount');