app/Http/Controllers/Admin/AuthController.php

    public function LoginCheck(Request $request)
    {
        //dd($request->all());
        $user = User::where('email', $request->email)->first();
---
select * from `users` where `email` = 'rafel@dnsgroup.net' limit 1