app/Http/Controllers/Admin/BusinessController.php

select * from `business_settings` where `type` = 'vat' limit 1
select * from `business_settings` where `type` = 'commission_type' limit 1
select * from `business_settings` where `type` = 'service_charge' limit 1
select * from `business_settings` where `type` = 'parent_dealer_commission' limit 1
select * from `business_settings` where `type` = 'child_dealer_commission' limit 1
select * from `business_settings` where `type` = 'default_address' limit 1
select * from `business_settings` where `type` = 'collection_center_commission' limit 1
---
    public function index()
    {

        $vat = BusinessSetting::where('type', 'vat')->first();
        $commissionType = BusinessSetting::where('type', 'commission_type')->first();
        $serviceCharge = BusinessSetting::where('type', 'service_charge')->first();
        $parentDealerCommission = BusinessSetting::where('type', 'parent_dealer_commission')->first();
        $childDealerCommission = BusinessSetting::where('type', 'child_dealer_commission')->first();
        $default_address = BusinessSetting::where('type', 'default_address')->first();
        $collection_center_commission = BusinessSetting::where('type', 'collection_center_commission')->first();