app/Http/Controllers/Admin/CategoryController.php

select * from `categories`
---
    public function index()
    {
        $categories = Category::all();