app/Http/Controllers/Admin/DashboardController.php

    public function index()
    {
        $counts = DB::select("SELECT
        (SELECT COUNT(*) FROM blog_categories) as blog_categories,
        (SELECT COUNT(*) FROM blogs) as blogs,
        (SELECT COUNT(*) FROM brands) as brands,
        (SELECT COUNT(*) FROM categories) as insurance_categories,
        (SELECT COUNT(*) FROM claim_payment_requests) as device_service_request,
        (SELECT COUNT(*) FROM dealers) as dealers,
        (SELECT COUNT(*) FROM device_categories) as device_categories,
        (SELECT COUNT(*) FROM device_claims) as device_claims,
        (SELECT COUNT(*) FROM device_insurances) as device_insurances,
        (SELECT COUNT(*) FROM device_models) as device_models,
        (SELECT COUNT(*) FROM device_subcategories) as device_subcategories,
        (SELECT COUNT(*) FROM 	imei_datas) as 	imei_datas,
        (SELECT COUNT(*) FROM insurance_packages) as insurance_packages,
        (SELECT COUNT(*) FROM insurance_types) as insurance_types,
        (SELECT COUNT(*) FROM messages) as messages,
        (SELECT COUNT(*) FROM partners) as partners,
        (SELECT COUNT(*) FROM parts) as parts,
        (SELECT COUNT(*) FROM payment_request_to_admins) as service_charge_withdraw_request,
        (SELECT COUNT(*) FROM policy_providers) as policy_providers,
        (SELECT COUNT(*) FROM sliders) as sliders,
        (SELECT COUNT(*) FROM travel_ins_orders) as travel_ins_orders,
        (SELECT COUNT(*) FROM travel_ins_plans_categories) as travel_ins_plans_categories,
        (SELECT COUNT(*) FROM users) as users
        ");
        $counts = collect($counts[0]);

        ## Parent due balance
        $parentDueBalance = Dealer::sum('due_balance');


        ## Parent due balance
        $dueBalanceCollection = DueBalanceCollection::sum('collected_amount');
---
select sum(`due_balance`) as aggregate from `dealers`
select sum(`collected_amount`) as aggregate from `due_balance_collections`

    public function users()
    {
        $users = User::get();
---
select * from `users`