app/Http/Controllers/Admin/DeviceInsuranceController.php

select * from `device_insurances` order by `created_at` desc
---
    public function index()
    {
        $deviceInsurances = DeviceInsurance::with(['parent'])->latest()->get();