app/Http/Controllers/Admin/InsurancePackageController.php

select * from `insurance_packages` order by `created_at` desc
---
    public function index()
    {
        $insurancePackages = InsurancePackage::latest()->get();