app/Http/Controllers/Admin/InsuranceTypeController.php

    public function index()
    {
        $insuranceTypes = InsuranceType::with('deviceSubcategory')->get();
---
select * from `device_subcategories` where `device_subcategories`.`id` in (3)
select * from `insurance_types`