app/Http/Controllers/Admin/InsuranceDiscountController.php

    public function index()
    {
        $insuranceDiscounts = InsuranceDiscount::latest()->get();
---
select * from `insurance_discounts` order by `created_at` desc