app/Http/Controllers/Admin/TravelInsuranceController.php

select * from `travel_ins_orders` order by `created_at` desc
---
    public function travel_insurance_orders()
    {
        $tarvelInsurances = TravelInsOrder::latest()->get();

select * from `policy_providers` where `policy_providers`.`id` in (2)
select * from `travel_ins_orders` where `travel_ins_orders`.`id` = '127' limit 1
---
    public function edit($travelInsOrder)
    {
        $model = TravelInsOrder::with(['policy_provider'])->find($travelInsOrder);